1
3
4
5
6
8
9
10
11
12
14
16
17
18
20
21
22
24
25
26
27
28
30
31
32
33
35
36
37
38
39
40
41
43
44
46
48
49
50
51
52
53
55
56
57
58
59
60
61
62
63
64
65
66
67
68
69
70
71
72
73
77
78
82
83
84
85
86
87
88
89
92
93
95
100
101
103
104
106
108
109
110
112
113
114
115
116
118
119
121
122
123
124
125
126
127
129
132
133
134
135
136
137
139
141
142
143
147
148
149
150
151
152
153
154
155
156
157
160
161
163
164
165
167
169
170
171
173
174
175
176
177
178
179
180
182
184
185
186
187
188
189
190
191
192
193
194
195
197
198
199
200
201
203
204
205
206
208
209
210
211
212
213
214
215
216
218
219
220
222
223
224
225
226
227
228
229
230
231
233
234
235
236
237
238
239
240
241
242
244
245
246
247
248
249
250
251
252
253
254
255
256
257
258
259
260
261
263
264
265
266
267
269
272
273
274
275
277
278
279
280
281
282
283
286
288
289
293
295
296
297
299
300
301
302
303
304
305
306
307
309
310
312
313
314
315
317
318
321
322
323
324
325
326
328
333
334
335
336
337
342
343
344
345
346
347
349
350
351
352
353
354
355
356
357
358
359
360
361
362
368
369
371
372
376
379
380
382
384
385
386
388
390
393
394
395
396
397
398
399
400
401
404
405
406
407
408
409
410
411
412
413
414
416
420
421
422
423
424
427
428
429
430
431
432
433
434
435
436
437
438
440
441
443
445
447
448
449
450
451
452
453
454
455
456
457
458
459
460
461
462
463
465
466
467
468
469
470
471
472
473
474
475
476
477
478
479
480
481
482
483
485
486
487
488
489
490
491
492
493
494
495
496
497
498
499
501
504
505
506
507
508
509
510
512
514
517
522
523
524
525
526
529
532
533
534
535
537
538
539
540
541
542
543
544
545
546
547
548
549
550
551
552
553
554
555
556
557
558
559
560
561
562
563
564
565
566
568
569
570
571
572
573
574
575
576
577
578
580
581
583
586
587
588
589
591
592
595
598
600
601
604
605
606
607
608
609
610
611
613
614
615
616
617
618
620
621
622
626
627
628
629
631
632
633
634
636
637
638
640
641
642
643
644
645
646
647
648
651
654
655
656
657
658
659
660
661
662
663
664
665
666
667
668
670
671
672
673
674
675
676
677
678
679
680
681
682
684
685
686
687
688
690
691
692
693
695
696
697
698
700
701
703
704
706
707
708
711
712
714
716
717
718
719
720
721
722
723
724
725
726
727
728
731
733
734
735
736
737
739
740
743
744
745
747
748
750
754
755
759
760
761
762
763
764
766
767
768
769
770
771
772
773
774
776
778
779
782
783
785
786
787
789
790
791
792
793
795
796
797
798
800
801
802
803
804
805
806
808
810
811
813
815
816
817
818
819
820
821
823
826
829
830
831
832
834
835
836
839
841
842
843
846
847
848
854
855
857
858
859
860
862
863
864
865
866
867
868
870
871
873
876
880
882
883
884
887
889
895
896
897
898
900
901
902
903
905
906
912
914
915
916
917
919
920
921
922
923
924
925
926
927
928
929
930
931
933
934
936
938
940
941
944
946
947
948
949
952
953
955
956
958
960
961
962
963
965
966
967
969
972
976
977
978
981
982
984
986
988
989
991
992
993
995
999
1000
1002
1004
1005
1006
1008
1010
1011
1013
1015
1016
1017
1018
1019
1020
1023
1024
1025
1026
1027
1028
1029
1031
1032
1033
1034
1035
1036
1037
1039
1041
1042
1044
1045
1046
1047
1049
1050
1052
1055
1056
1057
1058
1059
1060
1063
1065
1066
1067
1068
1069
1073
1076
1079
1080
1081
1082
1084
1085
1086
1087
1088
1089
1090
1091
1093
1094
1095
1098
1100
1101
1103
1104
1105
1106
1107
1108
1111
1113
1114
1116
1117
1120
1121
1123
1124
1125
1126
1127
1129
1130
1135
1137
1139
1141
1142
1144
1145
1147
1152
1153
1157
1158
1159
1164
1165
1166
1168
1171
1173
1174
1179
1182
1185
1187
1188
1191
1195
1197
1199
1201
1202
1203
1206
1208
1209
1211
1215
1216
1217
1218
1219
1220
1221
1222
1224
1225
1227
1228
1229
1230
1231
1232
1233
1235
1238
1239
1240
1242
1243
1245
1247
1248
1251
1257
1258
1260
1261
1262
1266
1267
1268
1269
1270
1271
1272
1273
1275
1276
1278
1279
1280
1286
1287
1288
1291
1292
1293
1294
1295
1297
1303
1304
1305
1306
1307
1309
1311
1312
1318
1320
1322
1324
1325
1326
1327
1328
1329
1330
1331
1332
1334
1337
1339
1340
1341
1342
1343
1344
1345
1346
1348
1349
1351
1354
1356
1357
1361
1364
1365
1367
1372
1373
1374
1376
1377
1381
1382
1384
1385
1386
1387
1388
1389
1390
1392
1396
1404
1411
1415
1416
1418
1420
1422
1429
1436
1439
1440
1442
1448
1452
1453
1455
1457
1458
1459
1460
1461
1462
1463
1468
1470
1472
1474
1475
1476
1478
1480
1482
1484
1485
1486
1487
1488
1491
1493
1495
1498
1499
1501
1504
1508
1509
1510
1511
1515
1516
1519
1520
1522
1523
1526
1527
1529
1534
1535
1536
1537
1538
1539
1540
1542
1543
1544
1547
1550
1551
1556
1557
1558
1561
1564
1566
1567
1570
1572
1573
1575
1581
1582
1583
1586
1587
1588
1592
1596
1598
1600
1601
1603
1606
1607
1608
1611
1612
1613
1616
1620
1621
1622
1625
1626
1628
1629
1630
1633
1634
1637
1639
1640
1641
1642
1643
1651
1654
1655
1656
1657
1659
1660
1661
1663
1664
1667
1670
1673
1674
1675
1677
1678
1679
1680
1681
1682
1683
1686
1689
1690
1691
1695
1697
1698
1699
1701
1704
1705
1710
1711
1712
1713
1716
1717
1721
1722
1724
1726
1729
1730
1731
1733
1734
1737
1738
1739
1741
1742
1743
1746
1748
1749
1750
1752
1757
1758
1760
1761
1763
1764
1765
1769
1771
1772
1773
1774
1777
1780
1783
1784
1785
1787
1789
1792
1793
1795
1796
1797
1798
1800
1801
1803
1804
1805
1807
1810
1812
1814
1815
1823
1825
1829
1830
1834
1839
1840
1841
1843
1844
1846
1850
1851
1852
1853
1858
1864
1865
1869
1870
1875
1876
1877
1878
1879
1880
1881
1882
1886
1888
1892
1894
1895
1896
1897
1898
1908
1911
1914
1921
1923
1924
1925
1927
1928
1932
1935
1936
1937
1940
1942
1943
1945
1946
1948
1949
1950
1951
1952
1953
1957
1958
1959
1960
1961
1962
1967
1968
1969
1970
1976
1978
1981
1982
1989
1993
1997
2001
2002
2006
2007
2008
2012
2014
2016
2024
2026
2032
2036
2037
2040
2041
2043
2044
2045
2046
2047
2049
2053
2056
2059
2060
2061
2063
2066
2069
2070
2071
2072
2074
2077
2082
2083
2084
2086
2087
2091
2092
2093
2094
2095
2096
2097
2099
2100
2102
2106
2111
2112
2119
2120
2121
2126
2127
2128
2129
2131
2132
2134
2135
2136
2137
2138
2139
2141
2143
2144
2145
2146
2147
2148
2153
2154
2155
2156
2157
2158
2160
2161
2165
2166
2167
2170
2173
2175
2184
2185
2187
2188
2189
2193
2195
2197
2203
2204
2205
2207
2213
2214
2215
2216
2217
2218
2219
2220
2221
2223
2225
2226
2227
2228
2229
2231
2232
2233
2237
2239
2243
2244
2245
2247
2248
2250
2258
2259
2261
2262
2264
2266
2268
2270
2272
2273
2274
2275
2276
2279
2286
2288
2292
2299
2312
2314
2315
2317
2318
2319
2321
2322
2323
2324
2325
2327
2329
2333
2338
2339
2340
2342
2350
2351
2352
2353
2358
2361
2362
2363
2364
2366
2369
2370
2371
2374
2379
2382
2383
2384
2408
2416
2417
2418
2421
2425
2427
2429
2430
2431
2435
2443
2447
2448
2450
2452
2453
2454
2456
2458
2459
2463
2464
2465
2466
2467
2471
2472
2473
2475
2477
2478
2479
2483
2484
2495
2497
2505
2512
2514
2517
2518
2523
2525
2528
2529
2530
2533
2536
2537
2538
2539
2540
2543
2546
2547
2550
2551
2560
2563
2566
2570
2573
2576
2578
2584
2585
2586
2587
2590
2592
2595
2597
2601
2602
2604
2606
2607
2608
2609
2610
2611
2613
2615
2616
2617
2620
2621
2624
2626
2627
2632
2633
2634
2635
2639
2641
2642
2643
2645
2646
2647
2649
2650
2651
2653
2655
2656
2664
2671
2674
2675
2680
2683
2684
2686
2687
2693
2696
2697
2700
2702
2703
2704
2705
2706
2712
2713
2717
2718
2720
2721
2725
2726
2727
2729
2732
2733
2734
2737
2738
2739
2740
2741
2742
2743
2744
2745
2748
2751
2752
2755
2756
2758
2759
2764
2767
2770
2771
2773
2774
2775
2777
2778
2779
2781
2789
2790
2800
2802
2803
2807
2811
2812
2814
2818
2820
2821
2822
2825
2830
2834
2839
2841
2844
2846
2847
2848
2856
2857
2861
2864
2865
2866
2872
2873
2876
2879
2882
2885
2886
2892
2893
2895
2898
2902
2903
2905
2906
2915
2920
2927
2928
2937
2938
2941
2945
2947
2951
2954
2955
2962
2971
2972
2974
2979
2984
2989
2994
2996
2997
3003
3005
3007
3013
3015
3017
3019
3021
3022
3023
3024
3025
3028
3029
3032
3034
3035
3038
3041
3046
3047
3050
3051
3053
3056
3057
3059
3060
3061
3062
3063
3066
3068
3071
3077
3087
3092
3094
3098
3105
3106
3120
3124
3127
3132
3135
3139
3140
3143
3146
3148
3149
3159
3160
3162
3165
3168
3169
3170
3183
3184
3185
3186
3190
3192
3193
3194
3203
3205
3206
3207
3208
3209
3210
3215
3229
3231
3232
3234
3236
3238
3239
3249
3251
3252
3253
3255
3256
3258
3259
3263
3265
3267
3271
3272
3273
3274
3282
3284
3287
3289
3291
3292
3293
3294
3296
3297
3299
3300
3303
3304
3307
3309
3313
3315
3317
3318
3319
3320
3322
3326
3327
3334
3335
3336
3338
3341
3344
3348
3349
3350
3352
3353
3356
3364
3371
3373
3377
3379
3380
3387
3388
3389
3395
3400
3403
3405
3406
3407
3408
3410
3415
3417
3418
3419
3425
3430
3432
3433
3435
3438
3441
3450
3455
3457
3458
3462
3466
3467
3469
3480
3486
3488
3490
3491
3493
3494
3499
3503
3510
3514
3516
3517
3519
3523
3530
3539
3543
3547
3551
3553
3554
3560
3561
3563
3566
3569
3578
3582
3586
3587
3595
3597
3598
3600
3608
3609
3614
3621
3622
3626
3627
3629
3637
3644
3648
3649
3650
3651
3661
3662
3669
3670
3674
3676
3680
3691
3692
3694
3695
3696
3699
3704
3705
3706
3710
3714
3717
3719
3720
3728
3730
3734
3736
3738
3742
3743
3747
3750
3752
3753
3756
3757
3760
3761
3763
3764
3765
3768
3773
3776
3778
3779
3784
3788
3793
3795
3800
3801
3807
3809
3813
3814
3815
3816
3817
3820
3821
3824
3833
3834
3836
3839
3840
3841
3851
3856
3857
3858
3859
3860
3861
3863
3867
3868
3870
3871
3873
3875
3876
3879
3883
3888
3889
3892
3893
3895
3897
3901
3902
3903
3904
3910
3914
3917
3920
3925
3929
3930
3933
3935
3937
3938
3939
3948
3953
3955
3958
3959
3961
3963
3967
3974
3975
3986
3994
3996
4001
4010
4011
4018
4027
4033
4035
4036
4037
4038
4040
4045
4049
4052
4054
4062
4064
4067
4068
4069
4071
4073
4083
4085
4086
4089
4093
4097
4098
4100
4101
4103
4104
4122
4123
4124
4125
4126
4128
4134
4135
4136
4138
4140
4142
4144
4147
4148
4151
4152
4155
4158
4159
4170
4171
4172
4175
4177
4180
4181
4182
4183
4184
4185
4193
4194
4198
4201
4203
4206
4207
4210
4213
4215
4220
4222
4227
4231
4232
4233
4237
4238
4239
4240
4244
4246
4252
4260
4265
4266
4277
4278
4285
4286
4287
4289
4291
4296
4302
4305
4306
4307
4309
4314
4317
4318
4319
4324
4328
4329
4332
4334
4335
4336
4339
4342
4343
4344
4355
4356
4358
4372
4379
4388
4393
4401
4406
4411
4414
4415
4417
4430
4431
4433
4435
4436
4443
4463
4465
4466
4467
4468
4470
4472
4483
4484
4486
4491
4495
4500
4506
4508
4511
4513
4516
4537
4543
4545
4547
4561
4562
4563
4565
4566
4567
4580
4582
4583
4584
4589
4594
4600
4601
4606
4611
4614
4632
4634
4635
4641
4650
4653
4656
4657
4662
4664
4668
4669
4673
4674
4676
4690
4702
4707
4711
4731
4744
4752
4755
4756
4758
4765
4766
4769
4776
4781
4783
4785
4787
4798
4799
4801
4804
4805
4806
4808
4809
4812
4816
4818
4819
4822
4823
4825
4828
4829
4831
4834
4835
4837
4841
4844
4847
4854
4857
4862
4869
4870
4872
4874
4876
4877
4880
4882
4894
4897
4898
4909
4916
4917
4922
4930
4931
4934
4935
4945
4947
4960
4964
4972
4973
4978
4979
4980
4982
4986
4988
4993
4996
4998
4999
5005
5014
5017
5027
5035
5039
5043
5048
5055
5059
5064
5065
5066
5070
5080
5085
5086
5088
5090
5108
5117
5121
5123
5132
5133
5137
5138
5141
5143
5149
5152
5156
5160
5161
5167
5180
5185
5186
5187
5194
5201
5217
5232
5235
5239
5240
5245
5260
5266
5267
5280
5282
5295
5300
5303
5310
5311
5318
5322
5326
5327
5329
5332
5339
5342
5346
5348
5352
5354
5357
5361
5363
5369
5376
5385
5386
5395
5396
5403
5404
5410
5411
5412
5413
5424
5430
5445
5448
5452
5466
5472
5474
5481
5483
5484
5491
5493
5497
5498
5501
5504
5507
5509
5510
5511
5512
5514
5517
5524
5534
5538
5543
5544
5546
5547
5557
5558
5560
5561
5563
5566
5575
5593
5596
5605
5612
5613
5615
5616
5622
5624
5639
5655
5661
5667
5673
5680
5688
5694
5703
5707
5713
5726
5730
5743
5747
5750
5761
5763
5764
5765
5772
5775
5781
5783
5803
5823
5826
5828
5836
5851
5855
5858
5865
5874
5880
5883
5888
5894
5897
5899
5900
5905
5906
5927
5929
5931
5939
5943
5944
5945
5946
5950
5958
5959
5961
5968
5976
5977
5990
5991
5992
5995
6004
6016
6020
6049
6053
6063
6068
6071
6074
6076
6093
6096
6100
6103
6108
6111
6114
6125
6128
6131
6132
6133
6137
6149
6152
6155
6164
6165
6183
6191
6194
6228
6232
6233
6234
6246
6275
6276
6282
6285
6289
6291
6292
6299
6311
6318
6325
6327
6329
6335
6346
6355
6360
6361
6367
6369
6372
6383
6404
6405
6412
6414
6422
6427
6438
6444
6447
6449
6451
6455
6463
6470
6472
6480
6497
6516
6535
6537
6542
6548
6585
6587
6602
6605
6606
6610
6622
6631
6637
6640
6651
6656
6657
6661
6665
6674
6680
6681
6687
6694
6699
6708
6712
6719
6724
6726
6732
6735
6742
6748
6807
6810
6819
6832
6835
6836
6840
6843
6846
6848
6897
6917
6918
6922
6923
6963
6978
6984
6987
6994
6997
7001
7022
7024
7035
7046
7052
7053
7065
7078
7079
7089
7097
7103
7108
7141
7142
7156
7159
7165
7167
7168
7169
7170
7171
7172
7173
7195
7199
7203
7206
7212
7213
7228
7235
7237
7238
7246
7268
7276
7317
7324
7332
7346
7358
7361
7365
7404
7408
7414
7423
7450
7462
7465
7467
7471
7478
7479
7481
7520
7535
7600
7601
7624
7632
7637
7640
7654
7672
7701
7711
7715
7721
7727
7734
7760
7767
7769
7770
7780
7782
7783
7788
7816
7819
7820
7846
7889
7890
7913
7928
7938
7948
7959
7970
7979
7980
7998
8013
8014
8019
8025
8027
8030
8034
8039
8051
8054
8055
8075
8078
8084
8097
8098
8107
8121
8129
8182
8192
8206
8207
8208
8223
8250
8288
8296
8297
8307
8311
8314
8345
8353
8371
8397
8405
8408
8409
8432
8437
8439
8447
8451
8458
8492
8501
8512
8542
8543
8549
8565
8581
8598
8639
8654
8669
8696
8705
8747
8754
8760
8835
8847
8848
8855
8910
8937
8939
8945
8961
8978
8990
9004
9025
9027
9059
9075
9082
9086
9104
9304
9324
9357
9387
9391
9400
9418
9420
9421
9427
9429
9430
9509
9512
9517
9555
9564
9577
9589
9601
9603
9613
9637
9683
9686
9695
9698
9717
9723
9749
9772
9837
9874
9884
9896
9897
9899
9903
9904
9918
9922
9931
9950
9952
10040
10068
10070
10072
10098
10120
10153
10224
10229
10234
10253
10266
10275
10380
10419
10532
10550
10555
10571
10579
10588
10589
10600
10621
10635
10641
10646
10648
10656
10661
10678
10679
10692
10699
10721
10727
10736
10746
10747
10748
10752
10778
10786
10807
10861
10874
10882
10883
10887
10918
10976
10980
11000
11001
11035
11038
11073
11138
11256
11259
11260
11290
11292
11295
11322
11323
11406
11414
11530
11546
11697
11698
11704
11711
11713
11871
12020
12069
12113
12161
12335
